БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПриоритетыРаспределенияАнализовПоЛабораториям/ПриоритетыРаспределенияАнализовПоЛабораториям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриоритетыРаспределенияАнализовПоЛабораториям</name>
  <resources>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </resources>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПриоритетыРаспределенияАнализовПоЛабораториям/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		
		Запись = РегистрыСведений.ПриоритетыРаспределенияАнализовПоЛабораториям.СоздатьМенеджерЗаписи();
		Запись.Лаборатория = ТекущаяЗапись.Лаборатория;
		Запись.Номенклатура = ТекущаяЗапись.Номенклатура;
		Запись.Филиал = ТекущаяЗапись.Филиал;
		Запись.Прочитать();
		Запись.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
